src/cf/Enums/ВидыОперацийРасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасходнаяНакладная</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПродажаПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаНаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаНаОтветХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратКомитенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзПереработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСОтветХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыкупТоваровКомиссионером</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыПриемаПередачиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыПриемаПередачиТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтКомитента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетКомитенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаКомиссионеру</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеВПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетПоПереработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветственноеХранение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийРасходнаяНакладная/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вид операции расходная накладная по типу приема-передачи товара
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - ПеречислениеСсылка.ТипыПриемаПередачиТоваров
//   * Значение - ПеречислениеСсылка.ВидыОперацийРасходнаяНакладная
Функция ПоТипуПриемаПередачиТоваров() Экспорт

	Результат = Новый Соответствие;
	Результат[Перечисления.ТипыПриемаПередачиТоваров.ПередачаКомиссионеру] = ПередачаНаКомиссию;
	Результат[Перечисления.ТипыПриемаПередачиТоваров.ПередачаВПереработку] = ПередачаВПереработку;
	Результат[Перечисления.ТипыПриемаПередачиТоваров.ОтветственноеХранение] = ПередачаНаОтветХранение;

	Возврат Результат;

КонецФункции

// Прослеживаемая операция
// 
// Параметры:
//  ВидОперации - ПеречислениеСсылка.ВидыОперацийРасходнаяНакладная
// 
// Возвращаемое значение:
//  Булево
Функция ПрослеживаемаяОперация(ВидОперации) Экспорт

	Возврат ВидОперации = ПродажаПокупателю Или ВидОперации = ВозвратПоставщику Или ВидОперации = ПередачаНаКомиссию
		Или ВидОперации = ВозвратКомитенту Или ВидОперации = ВыкупТоваровКомиссионером;

КонецФункции

#КонецОбласти

#КонецЕсли
